Revit 2024 API
CategoryNameMap Class
A map that contains a mapping of category name to its category object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class CategoryNameMap : APIObject,
	IEnumerable
Visual Basic
Public Class CategoryNameMap _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class CategoryNameMap : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CategoryNameMap
 Autodesk.Revit.DB.Categories
See Also
CategoryNameMap Members
Autodesk.Revit.DB Namespace